REGISTER_FOR_CHOICES = [("1", "خودم"), ("2", "شخص دیگر")]

GENDER_CHOICES = [("1", "آقا"), ("2", "خانوم")]


TAVALLOD_CHOICES = [(str(year), str(year)) for year in range(1330, 1391)]

OSTAANHAA_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "آذربایجان شرقی"),
    ("2", "آذربایجان غربی"),
    ("3", "اردبیل"),
    ("4", "اصفهان"),
    ("5", "البرز"),
    ("6", "ایلام"),
    ("7", "بوشهر"),
    ("8", "تهران"),
    ("9", "چهارمحال و بختیاری"),
    ("10", "خراسان جنوبی"),
    ("11", "خراسان رضوی"),
    ("12", "خراسان شمالی"),
    ("13", "خوزستان"),
    ("14", "زنجان"),
    ("15", "سمنان"),
    ("16", "سیستان و بلوچستان"),
    ("17", "فارس"),
    ("18", "قزوین"),
    ("19", "قم"),
    ("20", "کردستان"),
    ("21", "کرمان"),
    ("22", "کرمانشاه"),
    ("23", "کهگیلویه و بویراحمد"),
    ("24", "گلستان"),
    ("25", "گیلان"),
    ("26", "لرستان"),
    ("27", "مازندران"),
    ("28", "مرکزی"),
    ("29", "هرمزگان"),
    ("30", "همدان"),
    ("31", "یزد"),
]

QOWMIAT_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "فارس"),
    ("2", "ترک"),
    ("3", "عرب"),
    ("4", "کرد"),
    ("5", "لر"),
    ("6", "بلوچ"),
    ("7", "موارد دیگر"),
]

DIN_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "مسلمان - شیعه"),
    ("2", "مسلمان - سنی"),
    ("3", "زرتشتی"),
    ("4", "مسیحی"),
    ("5", "یهودی"),
    ("6", "موارد دیگر"),
]

ETEQAADAAT_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "معتقد به وجود خدا نیستم"),
    ("2", "خدا را قبول دارم و به دین اعتقاد ندارم"),
    ("3", "به دین اعتقاد دارم ولی واجبات را انجام نمی‌دهم"),
    ("4", "به دین اعتقاد دارم و واجبات را انجام می‌دهم."),
    ("5", "به امور دینی شدیدا پایبند هستم"),
]

AMAL_BE_AHKAAM_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "زیاد"),
    ("2", "متوسط"),
    ("3", "کم"),
]

QAD_CHOICES = [(str(qad), str(qad)) for qad in range(140, 201)]

VAZN_CHOICES = [(str(vazn), str(vazn)) for vazn in range(40, 151)]

RANG_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "سفید"),
    ("2", "روشن"),
    ("3", "گندمی"),
    ("4", "تیره"),
]

POUSHESH_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "رسمی"),
    ("2", "غیررسمی"),
    ("3", "محلی"),
    ("4", "چادری محجبه"),
    ("5", "گاهی چادری"),
    ("6", "مانتویی"),
]

ZIBAAYI_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "خیلی زیبا"),
    ("2", "زیبا"),
    ("3", "کمی زیبا"),
    ("4", "معمولی"),
]

SHOQL_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "بیکار"),
    ("2", "شغل دولتی"),
    ("3", "شغل حوزوی"),
    ("4", "شغل آزاد"),
]

EZDEVAAJ_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "بدون سابقه ازدواج"),
    ("2", "سابقه عقد"),
    ("3", "سابقه عروسی"),
    ("4", "دارای فرزند"),
]

TAHSIL_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "زیر دیپلم"),
    ("2", "دیپلم"),
    ("3", "کاردانی"),
    ("4", "کارشناسی"),
    ("5", "کارشناسی ارشد"),
    ("6", "دکتری و بالاتر"),
    ("7", "حوزوی سطح یک"),
    ("8", "حوزوی سطح دو"),
    ("9", "حوزوی سطح سه"),
]

SHOQLE_VAALEDEIN_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "مرحوم"),
    ("2", "بازنشسته"),
    ("3", "بیکار"),
    ("4", "شاغل"),
]

TALABEH_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "باشد"),
    ("2", "نباشد"),
]

SEYYED_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "باشد"),
    ("2", "نباشد"),
]

KHARIDE_KHODRO_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "زیر صد میلیون"),
    ("2", "صد تا دویست میلیون"),
    ("3", "دویست تا پانصد میلیون"),
    ("4", "پانصد میلیون تا یک میلیارد"),
    ("5", "بالای یک میلیارد"),
]

EHSAASAAT_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "احساساتی و رمانتیک"),
    ("2", "هم به احساسات اهمیت می‌دهم و هم به امور عقلی پایبند هستم"),
    ("3", "احساسات مانع پیشرفت است"),
]

ERTEBAATAAT_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "اهل رفت و آمد نیستم و دوستان زیادی ندارم"),
    ("2", "بین سه تا پنج دوست صمیمی دارم و حدودا ماهی یک بار به مهمانی می‌روم"),
    (
        "3",
        "از دوستان زیادی برخوردار هستم و بالای هفته‌ای یک بار به دیدن دوستان و مهمانی می‌روم",
    ),
]

JENSI_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "جایگاه امور جنسی در زندگی بسیار بی‌اهمیت است"),
    ("2", "اهمیت امور جنسی در زندگی به اندازه امور دیگر است"),
    (
        "3",
        "امور جنسی مهمترین نیاز بشر است که با ارضای آنها قسمت زیادی از تنش‌ها فروکش خواهد کرد",
    ),
]

KHAANEVAADEGI_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "خانواده‌دوست و خانواده‌محور"),
    ("2", "خانواده‌دوست و دوست‌محور"),
    ("3", "فاقد ارتباطات خانوادگی"),
    ("4", "فاقد ارتباطات خانوادگی و دوستانه"),
]

FARZAND_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "تعداد برادران و خواهران زیاد و دوستدار خانواده پرجمعیت"),
    ("2", "تعداد برادران و خواهران زیاد و دوستدار خانواده کم جمعیت"),
    ("3", "تعداد برادران و خواهران کم ولی دوستدار خانواده پرجمعیت"),
    ("4", "تعداد برادران و خواهران کم و دوستدار خانواده کم جمعیت"),
]

SHERKAT_DAR_MARAASEMAAT_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "معتقد و زیاد"),
    ("2", "معتقد و کم"),
    ("3", "غیرمعتقد"),
]

SALAAMAT_CHOICES = [
    ("0", "مهم نیست"),
    ("1", "سالم جسمی و روحی"),
    ("2", "اندکی مشکلات جسمی"),
    ("3", "اندکی مشکلات روحی"),
    ("4", "دارای مشکلات جسمی"),
    ("5", "دارای مشکلات روحی"),
    ("6", "دارای مشکلات جسمی و روحی"),
]


RELATION_CHOICES = [
    ('1', "درخواست فرستاده شده است"),
    ('2', "درخواست قبول شده است"),
    ('3', "درخواست رد شده است")

]